|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [168]:
# Read data and describe it
import pandas as pd
df = pd.read_csv('titanic_dataset.csv', index_col = 'Unnamed: 0')
df.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [25]:
df.columns

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [12]:
# df.drop('Unnamed: 0', axis = 1, inplace = True)

In [169]:
df.describe()

,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [154]:
# Find columns with missing data
df.isna().sum()

pclass        0
survived      0
name          0
gender        0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      0
dtype: int64

In [157]:
df[df.columns[df.isna().sum() > 0]].isna().sum()

age     263
fare      1
dtype: int64

In [27]:
# Print shape of dataset
df.shape  # first column is used as index

(1309, 14)

In [164]:
# df[df.isna().sum()/len(df)*100 >= 25]

C:\Users\Sneha\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

In [45]:
# drop columns with more than 25% missing data
df.isna().sum()/df.pclass.count() * 100

pclass      0.000000
survived    0.000000
name        0.000000
gender      0.000000
age         0.000000
sibsp       0.000000
parch       0.000000
ticket      0.000000
fare        0.076511
embarked    0.000000
dtype: float64

In [32]:
df.pclass.count()

1309

In [175]:
df.isna().sum()

pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [163]:
(df.isna().sum()/df.pclass.count() * 100  > 25)

pclass       False
survived     False
name         False
gender       False
age          False
sibsp        False
parch        False
ticket       False
fare         False
cabin         True
embarked     False
boat          True
body          True
home.dest     True
dtype: bool

In [173]:
df.columns[df.isna().sum()/df.pclass.count() * 100  > 25]

Index(['cabin', 'boat', 'body', 'home.dest'], dtype='object')

In [3]:
df.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [145]:
df.drop(df.columns[df.isna().sum()/df.pclass.count() * 100  > 25],axis=1, inplace = True)

In [5]:
df.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,S

In [179]:
df.shape

(1309, 10)

In [171]:
df.shape[0]*.25

327.25

In [178]:
df.dropna(axis = 1,thresh = df.shape[0]*.75, inplace = True)

# drop columns having independent values(which do not affect the survival rate).
df.corr()

In [75]:
df.corr()

            pclass  survived       age     sibsp     parch
pclass    1.000000 -0.312469 -0.408106  0.060832  0.018322
survived -0.312469  1.000000 -0.055513 -0.027825  0.082660
age      -0.408106 -0.055513  1.000000 -0.243699 -0.150917
sibsp     0.060832 -0.027825 -0.243699  1.000000  0.373587
parch     0.018322  0.082660 -0.150917  0.373587  1.000000

In [58]:
# check data types of all columns
df.dtypes

pclass        int64
survived      int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare         object
embarked     object
dtype: object

In [59]:
# convert price to numeric
df.fare.head()

0    $211.34
1    $151.55
2    $151.55
3    $151.55
4    $151.55
Name: fare, dtype: object

In [6]:
import re
df.fare = pd.to_numeric(df.fare.str.replace(r'\$',''))
df.dtypes

pclass        int64
survived      int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
embarked     object
dtype: object

In [95]:
df.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.34,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.55,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.55,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.55,S

In [7]:
# find columns still having missing/na values and also count of missing data
df.isna().sum()

pclass        0
survived      0
name          0
gender        0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [8]:
# fill na with mean for fare and age column 
df.fare.mean()

33.29626146789031

In [47]:
df[df.fare.isna() ]

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
1225,3,D,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,S

In [130]:
df[df.pclass==3].fare.mean()

13.30413841807905

In [145]:
# df[df.fare.isna()].fare= df[df.pclass==3].fare.mean() # mean is applied to a slice of df, not to the original df

In [161]:
df.loc[df[df.fare.isna()].index,'fare'] = df[df.pclass==3].fare.mean()

In [157]:
df[df.fare.isna() ].index

Int64Index([1225], dtype='int64')

In [164]:
df.loc[1225]

pclass                       3
survived                     0
name        Storey, Mr. Thomas
gender                    male
age                       60.5
sibsp                        0
parch                        0
ticket                    3701
fare                   13.3041
embarked                     S
Name: 1225, dtype: object

In [193]:
df.loc[df[df.age.isna()].index,'age'] = round(df.age.mean(),1)

In [167]:
df.age.mean()

29.8811345124283

In [127]:
round(df.age.mean(),1)

29.8

In [174]:
df[df.age==29.9].age.count()

263

In [11]:
# drop na values for embarked column.
df[df.embarked.isna()].index

Int64Index([168, 284], dtype='int64')

In [194]:
df.age.count() # counts non-na values

1307

In [191]:
df.drop(df[df.embarked.isna()].index, inplace = True)

In [186]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv('titanic_filtered_LM.csv')

# Name, ticket columns are not dropped in 'titanic_filtered_LM.csv'
# for filling df.Fare-NaN values df[df.pclass==3].fare.mean() is used instead of df.Fare.mean()

In [190]:
# for survived column replace 0 with D and 1 with A
df.survived = df.survived.map({0:'D',1:'A'})
df

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,1,A,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,S
1,1,A,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,S
2,1,D,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,S
3,1,D,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,S
4,1,D,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,S
...,...,...,...,...,...,...,...,...,...,...
1304,3,D,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,$14.45,C
1305,3,D,"Zabour, Miss. Thamine",female,NaN,1,0,2665,$14.45,C
1306,3,D,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,$7.23,C
1307,3,D,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,$7.23,C
1308,3,D,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,$7.88,S

In [35]:
# find the frequency of different values in survived column
df.survived.value_counts()

D    809
A    498
Name: survived, dtype: int64

In [19]:
809 + 498

1307

In [148]:
# group by gender and survived and see the counts in each category
for i,j in df.groupby(by=['gender','survived']):
    print(i,j.shape[0])

('female', 'A') 337
('female', 'D') 127
('male', 'A') 161
('male', 'D') 682

In [41]:
337+127+161+682

1307

In [202]:
df.groupby(by=['gender','survived']).size().index

MultiIndex([('female', 'A'),
            ('female', 'D'),
            (  'male', 'A'),
            (  'male', 'D')],
           names=['gender', 'survived'])

In [203]:
df.groupby(by=['gender','survived']).size()

gender  survived
female  A           337
        D           127
male    A           161
        D           682
dtype: int64

In [196]:
df.gender.value_counts()

male      843
female    464
Name: gender, dtype: int64

In [42]:
 # find different pclass and no of people in each class
df.pclass.value_counts()

3    709
1    321
2    277
Name: pclass, dtype: int64

In [43]:
709+321+277

1307

In [66]:
# find top 5 people with highest values of age. Count no of male and females in the top 5
df.nlargest(5,'age')

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
14,1,A,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,$30.00,S
61,1,A,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,$78.85,S
1235,3,D,"Svensson, Mr. Johan",male,74.0,0,0,347060,$7.78,S
9,1,D,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,$49.50,C
135,1,D,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,$34.65,C

In [67]:
df.nlargest(5,'age').gender.value_counts()

male      4
female    1
Name: gender, dtype: int64

In [111]:
# find max age male and female who survived
print(df[(df.survived== 'A') & (df.gender =='male' )].age.sort_values(ascending = False).head(1).values)

[80.]

In [110]:
print(df[(df.survived== 'A') & (df.gender =='female' )].age.sort_values(ascending = False).head(1).values)

[76.]

In [140]:
# get average age by gender
print('male average age : %0.1f' %df[df.gender == 'male'].age.mean())
print('female average age : %0.1f' %df[df.gender == 'female'].age.mean())

male average age : 30.4
female average age : 28.8

In [182]:
round(df.groupby(by='gender').age.mean(),1)

gender
female    28.7
male      30.6
Name: age, dtype: float64

In [183]:
df.groupby(by='gender').age.mean()

gender
female    28.687071
male      30.585233
Name: age, dtype: float64

In [184]:
df[df.gender == 'male'].age.mean()

30.585232978723408

In [185]:
df[df.gender == 'female'].age.mean()

28.6870706185567

In [195]:
# get average age by people survived vs not-survived
print('average age of survived people : %0.2f' %df[df.survived == 'A'].age.mean())
print('average age of not-survived people : %0.2f' %df[df.survived == 'D'].age.mean())

average age of survived people : 28.96
average age of not-survived people : 30.37

In [186]:
df.groupby(by='survived').age.mean()

survived
0    30.545369
1    28.918228
Name: age, dtype: float64

In [188]:
round(df.groupby(by='survived').age.mean(),2)

survived
0    30.55
1    28.92
Name: age, dtype: float64